tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/system/region_buffer/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1e-6;

pointSync true;

patchInfo
(
    {
        name             trackedSurface;
        constructFrom    set;
        set              faceSet_patch_trackedSurface;

        dictionary
        {
            type         patch;
        }
    }

    {
        name             sideWall;
        constructFrom    set;
        set              faceSet_patch_sideWall;

        dictionary
        {
            type         wall;
        }
    }

    {
        name             fixedMesh;
        constructFrom    set;
        set              faceSet_patch_fixedMesh;

        dictionary
        {
            type         patch;
        }
    }
);

// ************************************************************************* //
