tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/constant/region_fluid/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel              Smagorinsky;    // Smagorinsky, dynSmagorinsky, oneEqEddy, SpalartAllmarasDDES, SpalartAllmarasIDDES

delta                 smooth;

printCoeffs           on;

cubeRootVolCoeffs
{
    deltaCoeff        1;
}

dynSmagorinskyCoeffs
{
    filter            simple;    // laplace, anisotropic
}

smoothCoeffs
{
    delta             cubeRootVol;
    maxDeltaRatio     1.1;

    cubeRootVolCoeffs
    {
        deltaCoeff    1;
    }
}

// ************************************************************************* //
