tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/system/region_conductor/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;
setFormat           raw;
surfaceFormat       null;
sets 
(
    planexz
    {
        type cloud;
        axis    xyz;
        points
        (
            (0.0 0.0 9.99999999998e-07)
            (0.0 0.0 0.000500983333333)
            (0.0 0.0 0.00100096666667)
            (0.0 0.0 0.00150095)
            (0.0 0.0 0.00200093333333)
            (0.0 0.0 0.00250091666667)
            (0.0 0.0 0.0030009)
            (0.0 0.0 0.00350088333333)
            (0.0 0.0 0.00400086666667)
            (0.0 0.0 0.00450085)
            (0.0 0.0 0.00500083333333)
            (0.0 0.0 0.00550081666667)
            (0.0 0.0 0.0060008)
            (0.0 0.0 0.00650078333333)
            (0.0 0.0 0.00700076666667)
            (0.0 0.0 0.00750075)
            (0.0 0.0 0.00800073333333)
            (0.0 0.0 0.00850071666667)
            (0.0 0.0 0.0090007)
            (0.0 0.0 0.00950068333333)
            (0.0 0.0 0.0100006666667)
            (0.0 0.0 0.01050065)
            (0.0 0.0 0.0110006333333)
            (0.0 0.0 0.0115006166667)
            (0.0 0.0 0.0120006)
            (0.0 0.0 0.0125005833333)
            (0.0 0.0 0.0130005666667)
            (0.0 0.0 0.01350055)
            (0.0 0.0 0.0140005333333)
            (0.0 0.0 0.0145005166667)
            (0.0 0.0 0.0150005)
            (0.0 0.0 0.0155004833333)
            (0.0 0.0 0.0160004666667)
            (0.0 0.0 0.01650045)
            (0.0 0.0 0.0170004333333)
            (0.0 0.0 0.0175004166667)
            (0.0 0.0 0.0180004)
            (0.0 0.0 0.0185003833333)
            (0.0 0.0 0.0190003666667)
            (0.0 0.0 0.01950035)
            (0.0 0.0 0.0200003333333)
            (0.0 0.0 0.0205003166667)
            (0.0 0.0 0.0210003)
            (0.0 0.0 0.0215002833333)
            (0.0 0.0 0.0220002666667)
            (0.0 0.0 0.02250025)
            (0.0 0.0 0.0230002333333)
            (0.0 0.0 0.0235002166667)
            (0.0 0.0 0.0240002)
            (0.0 0.0 0.0245001833333)
            (0.0 0.0 0.0250001666667)
            (0.0 0.0 0.02550015)
            (0.0 0.0 0.0260001333333)
            (0.0 0.0 0.0265001166667)
            (0.0 0.0 0.0270001)
            (0.0 0.0 0.0275000833333)
            (0.0 0.0 0.0280000666667)
            (0.0 0.0 0.02850005)
            (0.0 0.0 0.0290000333333)
            (0.0 0.0 0.0295000166667)
            (0.0 0.0 0.03)
            (0.0 0.0 0.0304999833333)
            (0.0 0.0 0.0309999666667)
            (0.0 0.0 0.03149995)
            (0.0 0.0 0.0319999333333)
            (0.0 0.0 0.0324999166667)
            (0.0 0.0 0.0329999)
            (0.0 0.0 0.0334998833333)
            (0.0 0.0 0.0339998666667)
            (0.0 0.0 0.03449985)
            (0.0 0.0 0.0349998333333)
            (0.0 0.0 0.0354998166667)
            (0.0 0.0 0.0359998)
            (0.0 0.0 0.0364997833333)
            (0.0 0.0 0.0369997666667)
            (0.0 0.0 0.03749975)
            (0.0 0.0 0.0379997333333)
            (0.0 0.0 0.0384997166667)
            (0.0 0.0 0.0389997)
            (0.0 0.0 0.0394996833333)
            (0.0 0.0 0.0399996666667)
            (0.0 0.0 0.04049965)
            (0.0 0.0 0.0409996333333)
            (0.0 0.0 0.0414996166667)
            (0.0 0.0 0.0419996)
            (0.0 0.0 0.0424995833333)
            (0.0 0.0 0.0429995666667)
            (0.0 0.0 0.04349955)
            (0.0 0.0 0.0439995333333)
            (0.0 0.0 0.0444995166667)
            (0.0 0.0 0.0449995)
            (0.0 0.0 0.0454994833333)
            (0.0 0.0 0.0459994666667)
            (0.0 0.0 0.04649945)
            (0.0 0.0 0.0469994333333)
            (0.0 0.0 0.0474994166667)
            (0.0 0.0 0.0479994)
            (0.0 0.0 0.0484993833333)
            (0.0 0.0 0.0489993666667)
...
        );
    }
);

surfaces 
(
);

fields 
(
    F
);

// ************************************************************************* //

